rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MUXSEL[%s]</name>
          <description>Mux Select</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUXSEL</name>
              <description>Mux Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>logic_0</name>
                  <description>Logic 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_1</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_2</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_3</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_4</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_5</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_6</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_7</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_8</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_in_9</name>
                  <description>LU_IN0 to LU_IN11</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_13</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_14</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_15</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_16</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_17</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_18</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_19</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_20</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_21</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_22</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_23</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lu_out_24</name>
                  <description>LU_OUT0 to LU_OUT11</description>
                  <value>0x18</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3030280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WP</name>
              <description>Write Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCL_MUXES</name>
              <description>Input Muxing</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no</name>
                  <description>Not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>yes</name>
                  <description>Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUM_SYNCS</name>
              <description>Sync Inputs</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_FORCES</name>
              <description>Force Inputs</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUM_LOGIC_CELLS</name>
              <description>LCs</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEN</name>
          <description>Software Override Enable</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWEN</name>
              <description>Software Override Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWVALUE</name>
          <description>Software Override Value</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWVALUE</name>
              <description>Software Override Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTEN</name>
          <description>Output Enable</description>
          <addressOffset>0x28C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUTEN</name>
              <description>Output Enables</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCIN</name>
          <description>Logic Inputs</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LC_INPUTS</name>
              <description>Logic Inputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWOUT</name>
          <description>Overridden Inputs</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWOUT</name>
              <description>Overridden Inputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCOUT</name>
          <description>Logic Outputs</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LCOUT</name>
              <description>Logic Outputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOUT</name>
          <description>Forced Outputs</description>
          <addressOffset>0x29C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORCEOUT</name>
              <description>Forced Outputs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCESTS</name>
          <description>Force Status</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>FORCESTS</name>
              <description>Force Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGEN</name>
          <description>Debug Mode Enable</description>
          <addressOffset>0x2A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBGEN</name>
              <description>Debug Mode Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
