rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>CWSELREI1</name>
          <description>Channel Analog Watchdog Select For External inputs</description>
          <addressOffset>0x2D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI1_8</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_9</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_10</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_11</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_12</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_13</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_14</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI1_15</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CWSELREI2</name>
          <description>Channel Analog Watchdog Select For External inputs</description>
          <addressOffset>0x2D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WSEL_SI2_16</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_17</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_18</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_19</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_20</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_21</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_22</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSEL_SI2_23</name>
              <description>Analog Watchdog Selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>THRHLR0</name>
                  <description>Analog watchdog THRHLR0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR1</name>
                  <description>Analog watchdog THRHLR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR2</name>
                  <description>Analog watchdog THRHLR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THRHLR3</name>
                  <description>Analog watchdog THRHLR3</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
