rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>SCAPABILITIES</name>
          <description>Slave Capabilities</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFC3FFE70</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IDENA</name>
              <description>ID 48b Handler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APPLICATION</name>
                  <description>APPLICATION</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>HW</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_BUT</name>
                  <description>HW_BUT</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARTNO</name>
                  <description>PARTNO</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDREG</name>
              <description>ID Register</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HDRSUPP</name>
              <description>High Data Rate Support</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MASTER</name>
              <description>Master</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASTERNOTSUPPORTED</name>
                  <description>MASTERNOTSUPPORTED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTERSUPPORTED</name>
                  <description>MASTERSUPPORTED</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SADDR</name>
              <description>Static Address</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STATIC</name>
                  <description>NO_STATIC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STATIC</name>
                  <description>STATIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW_CONTROL</name>
                  <description>HW_CONTROL</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG</name>
                  <description>CONFIG</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCCHANDLE</name>
              <description>Common Command Codes Handling</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IBI_MR_HJ</name>
              <description>In-Band Interrupts, Master Requests, Hot-Join Events</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMECTRL</name>
              <description>Time Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_TIME_CONTROL_TYPE</name>
                  <description>NO_TIME_CONTROL_TYPE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATLEAST1_TIME_CONTROL</name>
                  <description>ATLEAST1_TIME_CONTROL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTFIFO</name>
              <description>External FIFO</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EXT_FIFO</name>
                  <description>NO_EXT_FIFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STD_EXT_FIFO</name>
                  <description>STD_EXT_FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST_EXT_FIFO</name>
                  <description>REQUEST_EXT_FIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFOTX</name>
              <description>FIFO Transmit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_2BYTE</name>
                  <description>FIFO_2BYTE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_4BYTE</name>
                  <description>FIFO_4BYTE: 4-byte Tx FIFO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_8BYTE</name>
                  <description>FIFO_8BYTE: 8-byte Tx FIFO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_16BYTE</name>
                  <description>FIFO_16BYTE: 16-byte Tx FIFO or larger</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIFORX</name>
              <description>FIFO Receive</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_2BYTE</name>
                  <description>FIFO_2BYTE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_4BYTE</name>
                  <description>FIFO_4BYTE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_8BYTE</name>
                  <description>FIFO_8BYTE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_16BYTE</name>
                  <description>FIFO_16BYTE</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INT</name>
              <description>Interrupts</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTERRUPTSNO</name>
                  <description>Interrupts are not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPTSYES</name>
                  <description>Interrupts are supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA</name>
              <description>Direct Memory Access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMANO</name>
                  <description>DMA is not supported</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAYES</name>
                  <description>DMA is supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMAXLIMITS</name>
          <description>Slave Maximum Limits</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXRD</name>
              <description>Maximum Read Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXWR</name>
              <description>Maximum Write Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDPARTNO</name>
          <description>Slave ID Part Number</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PARTNO</name>
              <description>Part number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDEXT</name>
          <description>Slave ID Extension</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x660000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCR</name>
              <description>Device Characteristic Register</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCR</name>
              <description>Bus Characteristics Register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SVENDORID</name>
          <description>Slave Vendor ID</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VID</name>
              <description>Vendor ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STCCLOCK</name>
          <description>Slave Time Control Clock</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACCURACY</name>
              <description>Clock Accuracy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQ</name>
              <description>Clock Frequency</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMSGMAPADDR</name>
          <description>Slave Message Map Address</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAPLAST</name>
              <description>Matched Address Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LASTSTATIC</name>
              <description>Last Static Address Matched</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAPLASTM1</name>
              <description>Matched Previous Address Index 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAPLASTM2</name>
              <description>Matched Previous Index 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL</name>
          <description>Master Control</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQUEST</name>
              <description>Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>NONE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMITSTARTADDR</name>
                  <description>EMITSTARTADDR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMITSTOP</name>
                  <description>EMITSTOP</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBIACKNACK</name>
                  <description>IBIACKNACK</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROCESSDAA</name>
                  <description>PROCESSDAA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEEXIT</name>
                  <description>Force Exit and Slave Reset</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOIBI</name>
                  <description>AUTOIBI</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TYPE</name>
              <description>Bus Type with EmitStartAddr</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C</name>
                  <description>I3C</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C</name>
                  <description>I2C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DDR</name>
                  <description>DDR</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBIRESP</name>
              <description>In-Band Interrupt Response</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>ACK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NACK</name>
                  <description>NACK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK_WITH_MANDATORY</name>
                  <description>ACK_WITH_MANDATORY</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>MANUAL</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRWRITE</name>
                  <description>DIRWRITE: Write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIRREAD</name>
                  <description>DIRREAD: Read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDTERM</name>
              <description>Read Terminate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
