rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>XN_CTRL</name>
          <description>Memory Execution Control</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAM0_XN</name>
              <description>SRAM 0 Controller Access Execution Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM0_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM0_XN_1</name>
                  <description>Not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM1_XN</name>
              <description>SRAM 1 Controller Access Execution Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRAM1_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM1_XN_1</name>
                  <description>Not allowed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM0_XN</name>
              <description>ITCM Core 0 Direct Access Execution Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM0_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM0_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM1_XN</name>
              <description>ITCM Core 1 Direct Access Execution Control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM1_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM1_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM0_BK_XN</name>
              <description>ITCM Core 0 Backdoor Access Execution Control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM0_BK_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM0_BK_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM1_BK_XN</name>
              <description>ITCM Core 1 Backdoor Access Execution Control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM1_BK_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM1_BK_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM0_XN</name>
              <description>DTCM Core 0 Direct Access Execution Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM0_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM0_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM1_XN</name>
              <description>DTCM Core 1 Direct Access Execution Control</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM1_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM1_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM0_BK_XN</name>
              <description>DTCM Core 0 Backdoor Access Execution Control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM0_BK_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM0_BK_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM1_BK_XN</name>
              <description>DTCM Core 1 Backdoor Access Execution Control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM1_BK_XN_0</name>
                  <description>Allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM1_BK_XN_1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLK</name>
              <description>Soft Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLK_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLK_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HLK</name>
              <description>Hard Lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HLK_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLK_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
