rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PRAMC_0</name>
      <description>PRAMC</description>
      <groupName>PRAMC</groupName>
      <baseAddress>0x40264000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PRCR1</name>
          <description>Platform RAM Configuration register 1</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FT_DIS</name>
              <description>Flow-through disabled</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIRECT</name>
                  <description>RAM read data is passed directly to the system bus, incurring no additional latency</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGISTER</name>
                  <description>RAM read data is registered prior to returning on the system bus, incurring one extra cycle of latency</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_BO_DIS</name>
              <description>Port p0 read burst optimization disable.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPT_YES</name>
                  <description>64-bit WRP4 read bursts are optimized such that the controller returns a 2-1-1-1 response when PRCR1[FT_DIS ]=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPT_NO</name>
                  <description>64-bit WRP4 read bursts are not optimized; the controller returns a 2-2-2-2 response when PRCR1[FT_DIS ]=1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PFLASH</name>
      <description>PFLASH</description>
      <groupName>PFLASH</groupName>
      <baseAddress>0x40268000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4A0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PFCR[%s]</name>
          <description>Platform Flash Memory Configuration i</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>P0_CBFEN</name>
              <description>Port0 PFLASH Line Read Code Buffers Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_P0_CBFEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_P0_CBFEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_DBFEN</name>
              <description>Port0 PFLASH Line Read Data Buffers Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_P0_DBFEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_P0_DBFEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_CPFEN</name>
              <description>Port0 Code Prefetch Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_P0_CPFEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_P0_CPFEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>P0_DPFEN</name>
              <description>Port0 Data Prefetch Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_P0_DPFEN_0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_P0_DPFEN_1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCR4</name>
          <description>Platform Flash Memory Configuration 4</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DERR_SUP</name>
              <description>Data Error Suppression</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_DERR_SUP_0</name>
                  <description>Reports ECC events on data flash memory accesses</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_DERR_SUP_1</name>
                  <description>Single-bit and multi-bit ECC events on data flash memory accesses are suppressed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLK4_PS</name>
              <description>Block 4 Pipe Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_BLK4_PS_000</name>
                  <description>Block 4 access is always through pipe0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_BLK4_PS_001</name>
                  <description>Block 4 access is always through pipe1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_BLK4_PS_010</name>
                  <description>Block 4 access is always through pipe2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_BLK4_PS_011</name>
                  <description>Block 4 access is always through pipe3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_BLK4_PS_1xx</name>
                  <description>Block 4 access can be through any of the command pipes, based on which command pipe is available for block 4 access</description>
                  <value>#1xx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMEEE</name>
              <description>Disable Multi-Bit ECC Error Exception</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bfv_DMEEE_0</name>
                  <description>Error response sent on system bus for multi-bit ECC error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bfv_DMEEE_1</name>
                  <description>Error response not sent on system bus for multi-bit ECC error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFAPR</name>
          <description>Platform Flash Memory Access Protection</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M15AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M14AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M13AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M12AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M11AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M10AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M9AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M8AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M6AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M5AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M2AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M1AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M0AP</name>
              <description>Master n Access Protection</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCESS_NO</name>
                  <description>This master cannot perform any read accesses</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCESS_YES</name>
                  <description>This master can perform read accesses</description>
                  <value>#x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCPGM_PEADR_L</name>
          <description>Platform Flash Memory Program Erase Address Logical</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEADR_L</name>
              <description>Program Erase Address Logical</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
