rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>DERR_W1_0</name>
          <description>Domain Error Word 1</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error Attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECUSER_INSTR</name>
                  <description>Secure user mode, instruction fetch access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECUSER_DATA</name>
                  <description>Secure user mode, data access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_INSTR</name>
                  <description>Secure privileged mode, instruction fetch access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_DATA</name>
                  <description>Secure privileged mode, data access</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_INSTR</name>
                  <description>Nonsecure user mode, instruction fetch access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_DATA</name>
                  <description>Nonsecure user mode, data access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_INSTR</name>
                  <description>Nonsecure privileged mode, instruction fetch access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_DATA</name>
                  <description>Nonsecure privileged mode, data access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error Read Or Write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ_ACCESS</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error Port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EST</name>
              <description>Error State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VIOLTN_0</name>
                  <description>No access violations detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_VIOLTN_1</name>
                  <description>No access violations detected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SNGL_VIOLTN</name>
                  <description>A single access violation has been detected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_VIOLTN</name>
                  <description>Multiple access violations have been detected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W3_0</name>
          <description>Domain Error Word 3</description>
          <addressOffset>0x40C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REARM</name>
                  <description>Rearms error capture, resets error capture registers, and deasserts instance bit in DERRLOCd</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_2</name>
                  <description>No effect</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_3</name>
                  <description>No effect</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W0_1</name>
          <description>Domain Error Word 0</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W1_1</name>
          <description>Domain Error Word 1</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error Attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECUSER_INSTR</name>
                  <description>Secure user mode, instruction fetch access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECUSER_DATA</name>
                  <description>Secure user mode, data access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_INSTR</name>
                  <description>Secure privileged mode, instruction fetch access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_DATA</name>
                  <description>Secure privileged mode, data access</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_INSTR</name>
                  <description>Nonsecure user mode, instruction fetch access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_DATA</name>
                  <description>Nonsecure user mode, data access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_INSTR</name>
                  <description>Nonsecure privileged mode, instruction fetch access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_DATA</name>
                  <description>Nonsecure privileged mode, data access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error Read Or Write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ_ACCESS</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error Port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EST</name>
              <description>Error State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VIOLTN_0</name>
                  <description>No access violations detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_VIOLTN_1</name>
                  <description>No access violations detected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SNGL_VIOLTN</name>
                  <description>A single access violation has been detected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_VIOLTN</name>
                  <description>Multiple access violations have been detected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W3_1</name>
          <description>Domain Error Word 3</description>
          <addressOffset>0x41C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REARM</name>
                  <description>Rearms error capture, resets error capture registers, and deasserts instance bit in DERRLOCd</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_2</name>
                  <description>No effect</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_3</name>
                  <description>No effect</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W0_16</name>
          <description>Domain Error Word 0</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W1_16</name>
          <description>Domain Error Word 1</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDID</name>
              <description>Error Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EATR</name>
              <description>Error Attributes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECUSER_INSTR</name>
                  <description>Secure user mode, instruction fetch access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECUSER_DATA</name>
                  <description>Secure user mode, data access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_INSTR</name>
                  <description>Secure privileged mode, instruction fetch access</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECPRIV_DATA</name>
                  <description>Secure privileged mode, data access</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_INSTR</name>
                  <description>Nonsecure user mode, instruction fetch access</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_USER_DATA</name>
                  <description>Nonsecure user mode, data access</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_INSTR</name>
                  <description>Nonsecure privileged mode, instruction fetch access</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEC_PRIV_DATA</name>
                  <description>Nonsecure privileged mode, data access</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERW</name>
              <description>Error Read Or Write</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ_ACCESS</name>
                  <description>Read access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE_ACCESS</name>
                  <description>Write access</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPORT</name>
              <description>Error Port</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EST</name>
              <description>Error State</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_VIOLTN_0</name>
                  <description>No access violations detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_VIOLTN_1</name>
                  <description>No access violations detected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SNGL_VIOLTN</name>
                  <description>A single access violation has been detected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULT_VIOLTN</name>
                  <description>Multiple access violations have been detected</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W3_16</name>
          <description>Domain Error Word 3</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RECR</name>
              <description>Rearm Error Capture Registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REARM</name>
                  <description>Rearms error capture, resets error capture registers, and deasserts instance bit in DERRLOCd</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_2</name>
                  <description>No effect</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EFFECT_3</name>
                  <description>No effect</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DERR_W0_17</name>
          <description>Domain Error Word 0</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EADDR</name>
              <description>Error Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
