rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>MDA_W0_0_DFMT0</name>
          <description>Master Domain Assignment</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIDS</name>
              <description>DID Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_REG_DID</name>
                  <description>Use the DID field of this register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_INPUT_DID</name>
                  <description>Use the input DID</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_CONCAT</name>
                  <description>Concatenate bits 3-2 of this register with the least significant 2 bits of the input DID (DID_in[1:0])</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Process Identifier Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOPROCID_0</name>
                  <description>No PID is included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOPROCID_1</name>
                  <description>No PID is included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE10</name>
                  <description>Partial domain hit = (PID &amp; ~PIDM) == (PIDm[PID] &amp; ~PIDM)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE11</name>
                  <description>Partial domain hit = ~((PID &amp; ~PIDM) == (PIDm[PID] &amp; ~PIDM))</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDM</name>
              <description>Process Identifier Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>Process Identifier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFMT</name>
              <description>Domain Format</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core bus master domain assignment (DFMT0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK1</name>
              <description>Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>UNLOCKED_READ</name>
                  <description>Unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_1_DFMT1</name>
          <description>Master Domain Assignment</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA</name>
              <description>Privileged Attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE2USER</name>
                  <description>Force to user</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE2PRIV</name>
                  <description>Force to privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BMSTR_ATTR</name>
                  <description>Use privileged attribute from the master</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA</name>
              <description>Secure Attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE</name>
                  <description>Force to secure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE</name>
                  <description>Force to nonsecure</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_ATTR_DIRCTLY</name>
                  <description>Use secure attribute from the master</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIDB</name>
              <description>DID Bypass</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDAN30</name>
                  <description>Bypass DID input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DID</name>
                  <description>Use DID input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFMT</name>
              <description>Domain Format</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Bus master domain assignment (DFMT1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK1</name>
              <description>Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>UNLOCKED_READ</name>
                  <description>Unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_2_DFMT1</name>
          <description>Master Domain Assignment</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PA</name>
              <description>Privileged Attribute</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE2USER</name>
                  <description>Force to user</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE2PRIV</name>
                  <description>Force to privileged</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BMSTR_ATTR</name>
                  <description>Use privileged attribute from the master</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SA</name>
              <description>Secure Attribute</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECURE</name>
                  <description>Force to secure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSECURE</name>
                  <description>Force to nonsecure</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_ATTR_DIRCTLY</name>
                  <description>Use secure attribute from the master</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIDB</name>
              <description>DID Bypass</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDAN30</name>
                  <description>Bypass DID input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DID</name>
                  <description>Use DID input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFMT</name>
              <description>Domain Format</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONPROC</name>
                  <description>Bus master domain assignment (DFMT1)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK1</name>
              <description>Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>UNLOCKED_READ</name>
                  <description>Unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MDA_W0_3_DFMT0</name>
          <description>Master Domain Assignment</description>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIDS</name>
              <description>DID Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_REG_DID</name>
                  <description>Use the DID field of this register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_INPUT_DID</name>
                  <description>Use the input DID</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_CONCAT</name>
                  <description>Concatenate bits 3-2 of this register with the least significant 2 bits of the input DID (DID_in[1:0])</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Process Identifier Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOPROCID_0</name>
                  <description>No PID is included</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOPROCID_1</name>
                  <description>No PID is included</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE10</name>
                  <description>Partial domain hit = (PID &amp; ~PIDM) == (PIDm[PID] &amp; ~PIDM)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PE11</name>
                  <description>Partial domain hit = ~((PID &amp; ~PIDM) == (PIDm[PID] &amp; ~PIDM))</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIDM</name>
              <description>Process Identifier Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PID</name>
              <description>Process Identifier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFMT</name>
              <description>Domain Format</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROC</name>
                  <description>Core bus master domain assignment (DFMT0)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK1</name>
              <description>Lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>UNLOCKED_READ</name>
                  <description>Unlocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>Locks</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Invalid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VALID</name>
                  <description>Valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
