rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>IFMCR29</name>
          <description>SIUL2 Interrupt Filter Maximum Counter Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXCNT</name>
              <description>Maximum Interrupt Filter Counter setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFMCR30</name>
          <description>SIUL2 Interrupt Filter Maximum Counter Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXCNT</name>
              <description>Maximum Interrupt Filter Counter setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFMCR31</name>
          <description>SIUL2 Interrupt Filter Maximum Counter Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MAXCNT</name>
              <description>Maximum Interrupt Filter Counter setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCPR</name>
          <description>SIUL2 Interrupt Filter Clock Prescaler Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IFCP</name>
              <description>Interrupt Filter Clock Prescaler setting</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR1</name>
          <description>SIUL2 User Defined Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EMIOSFLG16_EN</name>
              <description>EMIOS0 Output Flag 16 Monitor Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG17_EN</name>
              <description>EMIOS0 Output Flag 17 Monitor Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG18_EN</name>
              <description>EMIOS0 Output Flag 18 Monitor Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG19_EN</name>
              <description>EMIOS0 Output Flag 19 Monitor Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG20_EN</name>
              <description>EMIOS0 Output Flag 20 Monitor Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG21_EN</name>
              <description>EMIOS0 Output Flag 21 Monitor Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG22_EN</name>
              <description>EMIOS0 Output Flag 22 Monitor Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG23_EN</name>
              <description>EMIOS0 Output Flag 23 Monitor Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG0_EN</name>
              <description>EMIOS0 Output Flag 0 Monitor Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG1_EN</name>
              <description>EMIOS0 Output Flag 1 Monitor Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG2_EN</name>
              <description>EMIOS0 Output Flag 2 Monitor Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG3_EN</name>
              <description>EMIOS0 Output Flag 3 Monitor Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG4_EN</name>
              <description>EMIOS0 Output Flag 4 Monitor Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG5_EN</name>
              <description>EMIOS0 Output Flag 5 Monitor Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG6_EN</name>
              <description>EMIOS0 Output Flag 6 Monitor Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG7_EN</name>
              <description>EMIOS0 Output Flag 7 Monitor Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG8_EN</name>
              <description>EMIOS0 Output Flag 8 Monitor Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG9_EN</name>
              <description>EMIOS0 Output Flag 9 Monitor Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG10_EN</name>
              <description>EMIOS0 Output Flag 10 Monitor Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG11_EN</name>
              <description>EMIOS0 Output Flag 11 Monitor Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG12_EN</name>
              <description>EMIOS0 Output Flag 12 Monitor Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG13_EN</name>
              <description>EMIOS0 Output Flag 13 Monitor Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG14_EN</name>
              <description>EMIOS0 Output Flag 14 Monitor Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG15_EN</name>
              <description>EMIOS0 Output Flag 15 Monitor Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR0</name>
          <description>SIUL2 User Defined Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADC0EOC_EN</name>
              <description>ADC0 End of Conversion Trigger Monitor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1EOC_EN</name>
              <description>ADC1 End of Conversion Trigger Monitor</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2EOC_EN</name>
              <description>ADC2 End of Conversion Trigger Monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART0TRG_EN</name>
              <description>LPUART0 Output Trigger Monitor Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART1TRG_EN</name>
              <description>LPUART1 Output Trigger Monitor Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART2TRG_EN</name>
              <description>LPUART2 Output Trigger Monitor Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART3TRG_EN</name>
              <description>LPUART3 Output Trigger Monitor Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO0DMA_EN</name>
              <description>BCTU FIFO0 DMA Request Monitor Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO1DMA_EN</name>
              <description>BCTU FIFO1 DMA Request Monitor Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC0DMA_EN</name>
              <description>BCTU ADC0DR DMA Request Monitor Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC1DMA_EN</name>
              <description>BCTU ADC1DR DMA Request Monitor Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC2DMA_EN</name>
              <description>BCTU ADC2DR DMA Request Monitor Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO0INT_EN</name>
              <description>BCTU FIFO0 Interrupt Request Monitor Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO1INT_EN</name>
              <description>BCTU FIFO0 Interrupt Request Monitor Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTULISTINT_EN</name>
              <description>BCTU Conversion List Interrupt Request Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC0INT_EN</name>
              <description>BCTU ADC0DR Interrupt Request Monitor Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC1INT_EN</name>
              <description>BCTU ADC1DR Interrupt Request Monitor Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC2INT_EN</name>
              <description>BCTU ADC2DR Interrupt Request Monitor Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UDR3</name>
          <description>SIUL2 User Defined Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>EMIOSFLG16_EN</name>
              <description>EMIOS0 Output Flag 16 Monitor Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG17_EN</name>
              <description>EMIOS0 Output Flag 17 Monitor Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG18_EN</name>
              <description>EMIOS0 Output Flag 18 Monitor Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG19_EN</name>
              <description>EMIOS0 Output Flag 19 Monitor Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG20_EN</name>
              <description>EMIOS0 Output Flag 20 Monitor Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG21_EN</name>
              <description>EMIOS0 Output Flag 21 Monitor Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG22_EN</name>
              <description>EMIOS0 Output Flag 22 Monitor Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG23_EN</name>
              <description>EMIOS0 Output Flag 23 Monitor Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG0_EN</name>
              <description>EMIOS0 Output Flag 0 Monitor Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG1_EN</name>
              <description>EMIOS0 Output Flag 1 Monitor Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG2_EN</name>
              <description>EMIOS0 Output Flag 2 Monitor Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG3_EN</name>
              <description>EMIOS0 Output Flag 3 Monitor Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG4_EN</name>
              <description>EMIOS0 Output Flag 4 Monitor Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG5_EN</name>
              <description>EMIOS0 Output Flag 5 Monitor Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG6_EN</name>
              <description>EMIOS0 Output Flag 6 Monitor Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG7_EN</name>
              <description>EMIOS0 Output Flag 7 Monitor Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG8_EN</name>
              <description>EMIOS0 Output Flag 8 Monitor Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG9_EN</name>
              <description>EMIOS0 Output Flag 9 Monitor Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG10_EN</name>
              <description>EMIOS0 Output Flag 10 Monitor Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG11_EN</name>
              <description>EMIOS0 Output Flag 11 Monitor Enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG12_EN</name>
              <description>EMIOS0 Output Flag 12 Monitor Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG13_EN</name>
              <description>EMIOS0 Output Flag 13 Monitor Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG14_EN</name>
              <description>EMIOS0 Output Flag 14 Monitor Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EMIOSFLG15_EN</name>
              <description>EMIOS0 Output Flag 15 Monitor Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
