rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>UDR2</name>
          <description>SIUL2 User Defined Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>ADC0EOC_EN</name>
              <description>ADC0 End of Conversion Trigger Monitor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1EOC_EN</name>
              <description>ADC1 End of Conversion Trigger Monitor</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2EOC_EN</name>
              <description>ADC2 End of Conversion Trigger Monitor</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART0TRG_EN</name>
              <description>LPUART0 Output Trigger Monitor Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART1TRG_EN</name>
              <description>LPUART1 Output Trigger Monitor Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART2TRG_EN</name>
              <description>LPUART2 Output Trigger Monitor Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART3TRG_EN</name>
              <description>LPUART3 Output Trigger Monitor Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO0DMA_EN</name>
              <description>BCTU FIFO0 DMA Request Monitor Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO1DMA_EN</name>
              <description>BCTU FIFO1 DMA Request Monitor Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC0DMA_EN</name>
              <description>BCTU ADC0DR DMA Request Monitor Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC1DMA_EN</name>
              <description>BCTU ADC1DR DMA Request Monitor Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC2DMA_EN</name>
              <description>BCTU ADC2DR DMA Request Monitor Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO0INT_EN</name>
              <description>BCTU FIFO0 Interrupt Request Monitor Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUFIFO1INT_EN</name>
              <description>BCTU FIFO0 Interrupt Request Monitor Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTULISTINT_EN</name>
              <description>BCTU Conversion List Interrupt Request Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC0INT_EN</name>
              <description>BCTU ADC0DR Interrupt Request Monitor Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC1INT_EN</name>
              <description>BCTU ADC1DR Interrupt Request Monitor Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BCTUADC2INT_EN</name>
              <description>BCTU ADC2DR Interrupt Request Monitor Enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIDR3</name>
          <description>SIUL2 MCU ID Register 3</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>SYS_RAM_SIZE</name>
              <description>System RAM Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYS_RAM_SIZE_2</name>
                  <description>128kB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_RAM_SIZE_3</name>
                  <description>192kB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_RAM_SIZE_4</name>
                  <description>256kB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYS_RAM_SIZE_6</name>
                  <description>512kB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PART_NO_SUF</name>
              <description>Part Number Suffix</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PART_NO_SUF_0</name>
                  <description>None</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROD_FAM_NO</name>
              <description>Product Family Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROD_FAM_NO_32</name>
                  <description>32</description>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROD_FAM_LET</name>
              <description>Product Family Letter</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROD_FAM_LET_19</name>
                  <description>S</description>
                  <value>0x13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MIDR4</name>
          <description>SIUL2 MCU ID Register 4</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CORE_PLAT_FET</name>
              <description>Core Platform Options Feature</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CORE_PLAT_FET_0</name>
                  <description>Single core</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE_PLAT_FET_1</name>
                  <description>Dual core</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE_PLAT_FET_2</name>
                  <description>1x lock-step core</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE_PLAT_FET_3</name>
                  <description>1x lock-step core + 1 perf. core</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CORE_PLAT_FET_4</name>
                  <description>Triple core</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_FET</name>
              <description>Ethernet Feature</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_FET_0</name>
                  <description>No Ethernet</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_FET_1</name>
                  <description>Ethernet present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEC_FET</name>
              <description>Security Feature</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEC_FET_1</name>
                  <description>HSE-B</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MSCR0</name>
          <description>SIUL2 Multiplexed Signal Configuration Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSS_0</name>
              <description>Source Signal Select_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSS_1</name>
              <description>Source Signal Select_1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SSS_2</name>
              <description>Source Signal Select_2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMC</name>
              <description>Safe Mode Control</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMC_0</name>
                  <description>Disable (The output buffer returns to its previous state when the chip leaves Safe mode.)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMC_1</name>
                  <description>Don't disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IFE</name>
              <description>IFE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IFE_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IFE_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSE</name>
              <description>DSE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSE_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUS</name>
              <description>Pull Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUS_0</name>
                  <description>Pull down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_1</name>
                  <description>Pull up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUE_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUE_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRC</name>
              <description>Slew Rate Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRC_0</name>
                  <description>Fastest setting</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRC_1</name>
                  <description>Slowest setting</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKE</name>
              <description>Pad keeping enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKE_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKE_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV</name>
              <description>Invert</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_0</name>
                  <description>Don't invert</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_1</name>
                  <description>Invert</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IBE</name>
              <description>Input Buffer Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IBE_0</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IBE_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE</name>
              <description>GPIO Output Buffer Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE_0</name>
                  <description>Output driver disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE_1</name>
                  <description>Output driver enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
