rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>GPDI76</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x154F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI83</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1550</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI82</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1551</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI81</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1552</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI80</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1553</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI87</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1554</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI85</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1556</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI84</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1557</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI91</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1558</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI90</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1559</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI89</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI88</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI95</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI94</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI93</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI92</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x155F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI99</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1560</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI98</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1561</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI97</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1562</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI96</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1563</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI103</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1564</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
