rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>GPDI127</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI126</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI125</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI124</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x157F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI131</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1580</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI130</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1581</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI129</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1582</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI128</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1583</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI135</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1584</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI134</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1585</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI133</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1586</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI132</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1587</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI139</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1588</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI138</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1589</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI137</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158A</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI136</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158B</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI143</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158C</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI142</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158D</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI141</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158E</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI140</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x158F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPDI147</name>
          <description>SIUL2 GPIO Pad Data Input Register</description>
          <addressOffset>0x1590</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>PDI_n</name>
              <description>Pad Data In</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_a_LOW</name>
                  <description>Pad Data In Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_a_HIGH</name>
                  <description>Pad Data In High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
