rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>DCMRWD6</name>
          <description>Read Write GPR On Destructive Reset 6</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDMA_DBG_DIS_CM7_0</name>
              <description>eDMA Debug Disable Cortex-M7_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EDMA_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EDMA_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_DBG_DIS_CM7_0</name>
              <description>FCCU Debug Disable Cortex-M7_0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCU0_DBG_DIS_CM7_0</name>
              <description>LCU_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCU0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCU0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCU1_DBG_DIS_CM7_0</name>
              <description>LCU_1 Debug Disable Cortex-M7_0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCU1_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCU1_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMIOS0_DBG_DIS_CM7_0</name>
              <description>eMIOS_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMIOS0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMIOS0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMIOS1_DBG_DIS_CM7_0</name>
              <description>EMIOS1 debug disable bit for CM7_0. Set this bit 1 to disable the debug of IP.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMIOS1_DBG_DIS_CM7_0_0</name>
                  <description>eMIOS1 enters debug mode when CM7_0 enters debug mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMIOS1_DBG_DIS_CM7_0_1</name>
                  <description>eMIOS1 remains functional and is not impacted when CM7_0 enters debug mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTC_DBG_DIS_CM7_0</name>
              <description>RTC Debug Disable Cortex-M7_0</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTC_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWT0_DBG_DIS_CM7_0</name>
              <description>SWT_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SWT0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STM0_DBG_DIS_CM7_0</name>
              <description>STM_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STM0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STM0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT0_DBG_DIS_CM7_0</name>
              <description>PIT_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIT1_DBG_DIS_CM7_0</name>
              <description>PIT_1 Debug Disable Cortex-M7_0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIT1_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIT1_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI0_DBG_DIS_CM7_0</name>
              <description>LPSPI_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI1_DBG_DIS_CM7_0</name>
              <description>LPSPI_1 Debug Disable Cortex-M7_0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI1_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI1_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI2_DBG_DIS_CM7_0</name>
              <description>LPSPI_2 Debug Disable Cortex-M7_0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI2_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI2_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPSPI3_DBG_DIS_CM7_0</name>
              <description>LPSPI_3 Debug Disable Cortex-M7_0</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPSPI3_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPSPI3_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C0_DBG_DIS_CM7_0</name>
              <description>LPI2C_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPI2C1_DBG_DIS_CM7_0</name>
              <description>LPI2C_1 Debug Disable Cortex-M7_0</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPI2C1_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPI2C1_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXIO_DBG_DIS_CM7_0</name>
              <description>FlexIO Debug Disable Cortex-M7_0</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXIO_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXIO_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN0_DBG_DIS_CM7_0</name>
              <description>FlexCAN_0 Debug Disable Cortex-M7_0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN0_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN0_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN1_DBG_DIS_CM7_0</name>
              <description>FlexCAN_1 Debug Disable Cortex-M7_0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN1_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN1_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN2_DBG_DIS_CM7_0</name>
              <description>FlexCAN_2 Debug Disable Cortex-M7_0</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN2_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN2_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN3_DBG_DIS_CM7_0</name>
              <description>FlexCAN_3 Debug Disable Cortex-M7_0</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN3_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN3_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN4_DBG_DIS_CM7_0</name>
              <description>FlexCAN_4 Debug Disable Cortex-M7_0</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN4_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN4_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXCAN5_DBG_DIS_CM7_0</name>
              <description>FlexCAN_5 Debug Disable Cortex-M7_0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCAN5_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCAN5_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD7</name>
          <description>Read Write GPR On Destructive Reset 7</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>I3C_DBG_DIS_CM7_0</name>
              <description>I3C Debug Disable Cortex-M7_0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I3C_DBG_DIS_CM7_0_0</name>
                  <description>Enters Debug mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I3C_DBG_DIS_CM7_0_1</name>
                  <description>Remains functional and unimpacted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWD8</name>
          <description>Read Write GPR On Destructive Reset 8</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>DCMRWD9</name>
          <description>Read Write GPR On Destructive Reset 9</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
