rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>DCMRWF1</name>
          <description>Read Write GPR On Functional Reset 1</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCCU_SW_NCF0</name>
              <description>FCCU Software NCF 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF0_0</name>
                  <description>Not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF0_1</name>
                  <description>Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF1</name>
              <description>FCCU Software NCF 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF1_0</name>
                  <description>Not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF1_1</name>
                  <description>Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF2</name>
              <description>FCCU Software NCF 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF2_0</name>
                  <description>Not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF2_1</name>
                  <description>Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FCCU_SW_NCF3</name>
              <description>FCCU Software NCF 3</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FCCU_SW_NCF3_0</name>
                  <description>Not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCCU_SW_NCF3_1</name>
                  <description>Generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STANDBY_IO_CONFIG</name>
              <description>Standby I/O Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STANDBY_IO_CONFIG_0</name>
                  <description>Standby I/O configuration standby entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY_IO_CONFIG_1</name>
                  <description>Standby I/O configuration standby exit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_MON_EN</name>
              <description>Supply Monitoring Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_MON_EN_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_EN_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUPPLY_MON_SEL</name>
              <description>Supply Monitoring Select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_0</name>
                  <description>VDD_HV_A_DIV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_1</name>
                  <description>VDD_HV_B_DIV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_2</name>
                  <description>VDD_1.5_DIV</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_3</name>
                  <description>VDD_2.5_OSC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_4</name>
                  <description>VDD1.1_PD1_HOT_POINT</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_5</name>
                  <description>VDD1.1_PD1_COLD_POINT</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_6</name>
                  <description>VDD1.1_PLL</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY_MON_SEL_7</name>
                  <description>VDD1.1_PD0</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSS_LV_ANMUX_EN</name>
              <description>VSS_LV Monitoring Enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSS_LV_ANMUX_EN_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSS_LV_ANMUX_EN_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDD_HV_A_VLT_DVDR_EN</name>
              <description>VDD_HV_A Voltage Divider Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDD_HV_A_VLT_DVDR_EN_0</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD_HV_A_VLT_DVDR_EN_1</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWF2</name>
          <description>Read Write GPR On Functional Reset 2</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DCM_SCAN_BYP_STDBY_EXT</name>
              <description>DCM Scan Bypass Standby Exit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCM_SCAN_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCM_SCAN_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRC_TRIM_BYP_STDBY_EXT</name>
              <description>FIRC Trim Bypass Standby Exit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIRC_TRIM_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIRC_TRIM_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT</name>
              <description>PMC Trim MC_RGM DCF Bypass Standby Exit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMC_TRIM_RGM_DCF__BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRC_TRIM_BYP_STDBY_EXT</name>
              <description>SIRC Trim Bypass Standby Exit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRC_TRIM_BYP_STDBY_EXT_0</name>
                  <description>Not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRC_TRIM_BYP_STDBY_EXT_1</name>
                  <description>Bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSE_GSKT_BYPASS</name>
              <description>HSE_B Gasket Bypass</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSE_GSKT_BYPASS_0</name>
                  <description>Bypass configuration controlled by the DCF client</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_GSKT_BYPASS_1</name>
                  <description>Bypassed out of standby</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMRWF4</name>
          <description>Read Write GPR On Functional Reset 4</description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE_EN_ADC0_S8</name>
              <description>Mux Mode Enable ADC_0 Standard Channel 8</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S8_0</name>
                  <description>Selects GPIO_0 as ADC0_S8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S8_1</name>
                  <description>Selects GPIO_45 as ADC0_S8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC0_S9</name>
              <description>Mux Mode Enable ADC_0 Standard Channel 9</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S9_0</name>
                  <description>Selects GPIO_1 as ADC0_S9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC0_S9_1</name>
                  <description>Selects GPIO_46 as ADC0_S9</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S14</name>
              <description>Mux Mode Enable ADC_1 Standard Channel 14</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S14_0</name>
                  <description>Selects GPIO_69 as ADC1_S14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S14_1</name>
                  <description>Selects GPIO_32 as ADC1_S14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S15</name>
              <description>Mux Mode Enable ADC_1 Standard Channel 15</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S15_0</name>
                  <description>Selects GPIO_4 as ADC1_S15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S15_1</name>
                  <description>Selects GPIO_33 as ADC1_S15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S22</name>
              <description>Mux Mode Enable ADC_1 Standard Channel 22</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S22_0</name>
                  <description>Selects GPIO_124 as ADC1_S22</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S22_1</name>
                  <description>Selects GPIO_145 as ADC1_S22</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MUX_MODE_EN_ADC1_S23</name>
              <description>Mux Mode Enable ADC_1 Standard Channel 23</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S23_0</name>
                  <description>Selects GPIO_125 as ADC1_S23</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX_MODE_EN_ADC1_S23_1</name>
                  <description>Selects GPIO_146 as ADC1_S23</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN0_BYP</name>
              <description>Glitch Filter TRGMUX Input 0 Bypass</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN0_BYP_0</name>
                  <description>Enables glitch filter on TRGMUX input 63</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN0_BYP_1</name>
                  <description>Bypasses glitch filter on TRGMUX input 63</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN1_BYP</name>
              <description>Glitch Filter TRGMUX Input 1 Bypass</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN1_BYP_0</name>
                  <description>Enables glitch filter on TRGMUX input 62</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN1_BYP_1</name>
                  <description>Bypasses glitch filter on TRGMUX input 62</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN2_BYP</name>
              <description>Glitch Filter TRGMUX Input 2 Bypass</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN2_BYP_0</name>
                  <description>Enables glitch filter on TRGMUX input 61</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN2_BYP_1</name>
                  <description>Bypasses glitch filter on TRGMUX input 61</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLITCH_FIL_TRG_IN3_BYP</name>
              <description>Glitch Filter TRGMUX Input 3 Bypass</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN3_BYP_0</name>
                  <description>Enables glitch filter on TRGMUX input 60</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLITCH_FIL_TRG_IN3_BYP_1</name>
                  <description>Bypasses glitch filter on TRGMUX input 60</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM7_0_CPUWAIT</name>
              <description>Cortex-M7_0 CPU Wait</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM7_0_CPUWAIT_0</name>
                  <description>Disables CPUWAIT for Cortex-M7_0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM7_0_CPUWAIT_1</name>
                  <description>Places Cortex-M7_0 in Wait mode using CPUWAIT</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
