rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>DCMRWF5</name>
          <description>Read Write GPR On Functional Reset 5</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>BOOT_MODE</name>
              <description>Boot Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOOT_MODE_0</name>
                  <description>Normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOOT_MODE_1</name>
                  <description>Fast Standby</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOOT_ADDRESS</name>
              <description>Boot Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROPP1</name>
          <description>Read Only GPR On PMCPOR Reset 1</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>POR_WDG_STAT0</name>
              <description>POR_WDG Status 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT0_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT0_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT1</name>
              <description>POR_WDG Status 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT1_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT1_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT2</name>
              <description>POR_WDG Status 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT2_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT2_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT3</name>
              <description>POR_WDG Status 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT3_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT3_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT4</name>
              <description>POR_WDG Status 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT4_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT4_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT5</name>
              <description>POR_WDG Status 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT5_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT5_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT6</name>
              <description>POR_WDG Status 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT6_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT6_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT10</name>
              <description>POR_WDG Status 7</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT10_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT10_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT11</name>
              <description>POR_WDG Status 8</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT11_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT11_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT14</name>
              <description>POR_WDG Status 9</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT14_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT14_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT17</name>
              <description>POR_WDG Status 10</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT17_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT17_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT20</name>
              <description>POR_WDG Status 20</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT20_0</name>
                  <description>Inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT20_1</name>
                  <description>Active</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT29</name>
              <description>POR_WDG Status 29</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT29_0</name>
                  <description>Active</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT29_1</name>
                  <description>Inactive</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT30</name>
              <description>POR_WDG Status 30</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT30_0</name>
                  <description>Not acknowledged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT30_1</name>
                  <description>Acknowledged</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT31</name>
              <description>POR_WDG Status 31</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT31_0</name>
                  <description>Event not detected or no reset event arrived</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT31_1</name>
                  <description>Event detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCMROPP2</name>
          <description>Read Only GPR On PMCPOR Reset 2</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <modifiedWriteValues>oneToClear</modifiedWriteValues>
          <fields>
            <field>
              <name>POR_WDG_STAT32</name>
              <description>POR_WDG Status 32</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT32_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT32_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT35</name>
              <description>POR_WDG Status 35</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT35_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT35_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT36</name>
              <description>POR_WDG Status 36</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT36_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT36_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT38</name>
              <description>POR_WDG Status 38</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT38_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT38_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT39</name>
              <description>POR_WDG Status 39</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT39_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT39_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT40</name>
              <description>POR_WDG Status 40</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT40_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT40_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT41</name>
              <description>POR_WDG Status 41</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT41_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT41_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT48</name>
              <description>POR_WDG Status 48</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT48_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT48_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT52</name>
              <description>POR_WDG Status 52</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT52_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT52_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT61</name>
              <description>POR_WDG Status 61</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT61_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT61_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POR_WDG_STAT62</name>
              <description>POR_WDG Status 62</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POR_WDG_STAT62_0</name>
                  <description>0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_WDG_STAT62_1</name>
                  <description>1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
