rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="CMU_1">
      <name>CMU_2</name>
      <description>CMU_FM</description>
      <groupName>CMU_FM</groupName>
      <baseAddress>0x402BC040</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CMU2</name>
        <value>86</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TSPC</name>
      <description>TSPC</description>
      <groupName>TSPC</groupName>
      <baseAddress>0x402C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xA8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GRP_EN</name>
          <description>Group Enable</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRP1_EN</name>
              <description>Enable for GRP1_OBEn Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GRP1_value0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRP1_value1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GRP2_EN</name>
              <description>Enable for GRP2_OBEn Register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GRP2_value0</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GRP2_value1</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GRP1_OBE1</name>
          <description>Group OBE</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OBE0</name>
              <description>Output Buffer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE0_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE0_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE1</name>
              <description>Output Buffer Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE1_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE1_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE2</name>
              <description>Output Buffer Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE2_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE2_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE3</name>
              <description>Output Buffer Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE3_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE3_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE4</name>
              <description>Output Buffer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE4_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE4_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE5</name>
              <description>Output Buffer Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE5_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE5_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE6</name>
              <description>Output Buffer Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE6_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE6_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE7</name>
              <description>Output Buffer Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE7_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE7_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE8</name>
              <description>Output Buffer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE8_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE8_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE9</name>
              <description>Output Buffer Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE9_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE9_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE10</name>
              <description>Output Buffer Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE10_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE10_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE11</name>
              <description>Output Buffer Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE11_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE11_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE12</name>
              <description>Output Buffer Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE12_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE12_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE13</name>
              <description>Output Buffer Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE13_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE13_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE14</name>
              <description>Output Buffer Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE14_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE14_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE15</name>
              <description>Output Buffer Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE15_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE15_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE16</name>
              <description>Output Buffer Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE16_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE16_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE17</name>
              <description>Output Buffer Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE17_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE17_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE18</name>
              <description>Output Buffer Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE18_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE18_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE19</name>
              <description>Output Buffer Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE19_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE19_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE20</name>
              <description>Output Buffer Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE20_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE20_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE21</name>
              <description>Output Buffer Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE21_value0</name>
                  <description>OBE pad does not transition if any OBE in group transitions from high to low. The OBE pad value is unaltered at the output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBE21_value1</name>
                  <description>OBE pad transitions from high to low if any OBE in group transitions from high to low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBE22</name>
              <description>Output Buffer Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBE22_value0</name>
