rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FXOSC</name>
      <description>FXOSC</description>
      <groupName>FXOSC</groupName>
      <baseAddress>0x402D4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>FXOSC Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x19D00C0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSCON</name>
              <description>Crystal oscillator power-down control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>oscon_0</name>
                  <description>Disables FXOSC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>oscon_1</name>
                  <description>Enables FXOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALC_D</name>
              <description>Automatic level controller enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>alc_d_0</name>
                  <description>Enables automatic level controller</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>alc_d_1</name>
                  <description>Disables automatic level controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GM_SEL</name>
              <description>Crystal overdrive protection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>gm_sel_0000</name>
                  <description>0x</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0001</name>
                  <description>0.1004x</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0010</name>
                  <description>0.2009x</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0011</name>
                  <description>0.3013x</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0100</name>
                  <description>0.2343x</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0101</name>
                  <description>0.3348x</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0110</name>
                  <description>0.4345x</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_0111</name>
                  <description>0.5349x</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1000</name>
                  <description>0.4679x</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1001</name>
                  <description>0.5684x</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1010</name>
                  <description>0.6681x</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1011</name>
                  <description>0.7678x</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1100</name>
                  <description>0.7016x</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1101</name>
                  <description>0.8013x</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1110</name>
                  <description>0.9003x</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>gm_sel_1111</name>
                  <description>1x</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOCV</name>
              <description>End of count value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP_EN</name>
              <description>Comparator enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>comp_en_0</name>
                  <description>Comparator disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>comp_en_1</name>
                  <description>Comparator enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSC_BYP</name>
              <description>Oscillator bypass</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>osc_byp_0</name>
                  <description>Internal oscillator not bypassed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>osc_byp_1</name>
                  <description>Internal oscillator bypassed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Oscillator Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSC_STAT</name>
              <description>Crystal oscillator status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stat_0</name>
                  <description>Crystal oscillator is off or on but not stable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>stat_1</name>
                  <description>Crystal oscillator is on and providing a stable clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
