rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>MUX_4_CSS</name>
          <description>Clock Mux 4 Select Status Register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x80000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_SW</name>
              <description>Clock switch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAFE_SW</name>
              <description>Safe clock request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK</name>
                  <description>No safe clock switch operation was requested.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLOCK</name>
                  <description>Safe clock switch operation was requested.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWIP</name>
              <description>Switch in progress</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPETE</name>
                  <description>Clock source switching is complete.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>Clock source switching is in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWTRG</name>
              <description>Switch trigger cause</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <description>Switch after request succeeded.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_TARGET_CLOCK</name>
                  <description>Switch after the request failed because of an inactive target clock and the current clock is FIRC.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL_CURRENT_CLOCK</name>
                  <description>Switch after the request failed because of an inactive current clock and the current clock is FIRC.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_SUCCEED_INACTIVE</name>
                  <description>Switch to FIRC because of a safe clock request or reset succeeded, but the previous current clock source was inactive.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELSTAT</name>
              <description>Clock source selection status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_22</name>
                  <description>AIPS_PLAT_CLK</description>
                  <value>0x16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_4_DC_0</name>
          <description>Clock Mux 4 Divider 0 Control Register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Division value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE</name>
              <description>Divider enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Divider is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Divider is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_4_DIV_UPD_STAT</name>
          <description>Clock Mux 4 Divider Update Status Register</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_STAT</name>
              <description>Divider status for clock mux 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV_PENDING</name>
                  <description>No divider configuration update is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PENDING</name>
                  <description>Divider configuration update on at least one divider associated with this multiplexer is pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_5_CSC</name>
          <description>Clock Mux 5 Select Control Register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG</name>
              <description>Clock gate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCG</name>
              <description>Force clock gate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCTL</name>
              <description>Clock source selection control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_1</name>
                  <description>SIRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_4</name>
                  <description>SXOSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_23</name>
                  <description>AIPS_SLOW_CLK</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_5_CSS</name>
          <description>Clock Mux 5 Select Status Register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GRIP</name>
              <description>Gating request is in progress.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPLETED</name>
                  <description>Clock source gating or ungating has completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>Clock source gating or ungating is in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CS</name>
              <description>Clock status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GATED</name>
                  <description>Clock is gated to logic-0 at output of clock mux</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRANSPARENTs</name>
                  <description>Clock mux is transparent. Active clock pulses at input of clock mux results in same number of pulses at its output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELSTAT</name>
              <description>Clock source selection status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_1</name>
                  <description>SIRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_4</name>
                  <description>SXOSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_23</name>
                  <description>AIPS_SLOW_CLK</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_5_DC_0</name>
          <description>Clock Mux 5 Divider 0 Control Register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80010000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Division value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DE</name>
              <description>Divider enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Divider is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Divider is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_5_DIV_UPD_STAT</name>
          <description>Clock Mux 5 Divider Update Status Register</description>
          <addressOffset>0x47C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIV_STAT</name>
              <description>Divider status for clock mux 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DIV_PENDING</name>
                  <description>No divider configuration update is pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV_PENDING</name>
                  <description>Divider configuration update on at least one divider associated with this multiplexer is pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX_6_CSC</name>
          <description>Clock Mux 6 Select Control Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CG</name>
              <description>Clock gate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCG</name>
              <description>Force clock gate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SELCTL</name>
              <description>Clock source selection control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>clk_src_0</name>
                  <description>FIRC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_1</name>
                  <description>SIRC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_2</name>
                  <description>FXOSC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_4</name>
                  <description>SXOSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_8</name>
                  <description>PLL_PHI0_CLK</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_9</name>
                  <description>PLL_PHI1_CLK</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_16</name>
                  <description>CORE_CLK</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_19</name>
                  <description>HSE_CLK</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_22</name>
                  <description>AIPS_PLAT_CLK</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clk_src_23</name>
                  <description>AIPS_SLOW_CLK</description>
                  <value>0x17</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
