rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>MCRE</name>
          <description>Extended Module Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>n256K</name>
              <description>Number of 256 KB Blocks</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n256K_0</name>
                  <description>Zero 256 KB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_1</name>
                  <description>One 256 KB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_2</name>
                  <description>Two 256 KB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n256K_3</name>
                  <description>Four 256 KB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>n512K</name>
              <description>Number of 512 KB Blocks</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n512K_0</name>
                  <description>Zero 512 KB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_1</name>
                  <description>One 512 KB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_2</name>
                  <description>Two 512 KB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n512K_3</name>
                  <description>Four 512 KB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>n1M</name>
              <description>Number of 1 MB Blocks</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n1M_0</name>
                  <description>Zero 1 MB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_1</name>
                  <description>One 1 MB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_2</name>
                  <description>Two 1 MB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_3</name>
                  <description>Three 1 MB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n1M_4</name>
                  <description>Four 1 MB blocks</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>n2M</name>
              <description>Number of 2 MB Blocks</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>n2M_0</name>
                  <description>Zero 2 MB blocks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n2M_1</name>
                  <description>One 2 MB block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n2M_2</name>
                  <description>Two 2 MB blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n2M_3</name>
                  <description>Three 2 MB blocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>n2M_4</name>
                  <description>Four 2 MB blocks</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Module Control</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x600</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RWSC</name>
              <description>Wait State Control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWSC_1</name>
                  <description>One additional wait state is added.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_2</name>
                  <description>Two additional wait states are added.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_3</name>
                  <description>Three additional wait states are added.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_4</name>
                  <description>Four additional wait states are added.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_5</name>
                  <description>Five additional wait states are added.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_6</name>
                  <description>Six additional wait states are added.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_7</name>
                  <description>Seven additional wait states are added.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSC_8</name>
                  <description>Eight additional wait states are added.</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWSL</name>
              <description>Read Wait State Lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWSL_0</name>
                  <description>RWSC not locked and available for writing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWSL_1</name>
                  <description>RWSC locked and unavailable for writing</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADR</name>
          <description>Address</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>A0</name>
              <description>Address Region 0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A0_0</name>
                  <description>Address captured or to be accessed is not from region 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A0_1</name>
                  <description>Address captured or to be accessed is from region 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>A1</name>
              <description>Address Region 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A1_0</name>
                  <description>Address captured or to be accessed is not from region 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A1_1</name>
                  <description>Address captured or to be accessed is from region 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>A2</name>
              <description>Address Region 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A2_0</name>
                  <description>Address captured or to be accessed is not from region 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A2_1</name>
                  <description>Address captured or to be accessed is from region 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>A5</name>
              <description>Address Region 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A5_0</name>
                  <description>Address captured or to be accessed is not from region 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A5_1</name>
                  <description>Address captured or to be accessed is from region 5</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAD</name>
              <description>UTest NVM Address</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAD_0</name>
                  <description>Address captured or to be accessed is from the main array space</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAD_1</name>
                  <description>Address captured or to be accessed is from the UTest NVM array space</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PEADR</name>
          <description>Program and Erase Address</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEADDR</name>
              <description>Program and Erase Address</description>
              <bitOffset>5</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PEA0</name>
              <description>Program and Erase Address Region 0</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA0_0</name>
                  <description>Address accessed is not from region 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA0_1</name>
                  <description>Address accessed is from region 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEA1</name>
              <description>Program and Erase Address Region 1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA1_0</name>
                  <description>Address accessed is not from region 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA1_1</name>
                  <description>Address accessed is from region 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEA2</name>
              <description>Program and Erase Address Region 2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA2_0</name>
                  <description>Address accessed is not from region 2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA2_1</name>
                  <description>Address accessed is from region 2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEA3</name>
              <description>Program and Erase Address Region 3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA3_0</name>
                  <description>Address accessed is not from region 3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA3_1</name>
                  <description>Address accessed is from region 3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEA4</name>
              <description>Program and Erase Address Region 4</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA4_0</name>
                  <description>Address accessed is not from region 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA4_1</name>
                  <description>Adrress accessed is from region 4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEA5</name>
              <description>Program and Erase Address Region 5</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEA5_0</name>
                  <description>Address accessed is not from region 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEA5_1</name>
                  <description>Address accessed is from region 5</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEASAD</name>
              <description>UTest NVM Program and Erase Address</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEASAD_0</name>
                  <description>Address accessed is from the main array space</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEASAD_1</name>
                  <description>Address accessed is from the UTest NVM array space</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPELOCK</name>
          <description>Sector Program and Erase Hardware Lock</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPELOCK</name>
              <description>Sector Program and Erase Lock [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SSPELOCK</name>
          <description>Super Sector Program and Erase Hardware Lock</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSPELOCK</name>
              <description>Super Sector Program and Erase Lock [27:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XSPELOCK</name>
          <description>Express Sector Program and Erase Hardware Lock</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XSPELOCK</name>
              <description>Express Sector Program and Erase Lock [31:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XSSPELOCK</name>
          <description>Express Super Sector Program and Erase Hardware Lock</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XSSPELOCK</name>
              <description>Express Super Sector Program and Erase Lock [27:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TMD</name>
          <description>Test Mode Disable Password Check</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PWD</name>
              <description>Password Challenge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
