rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>EINOUT</name>
          <description>IO Control</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFCF</resetMask>
          <fields>
            <field>
              <name>EOUT0</name>
              <description>EOUT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>force EOUT[0] = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>force EOUT[0] = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EOUT1</name>
              <description>EOUT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>force EOUT[1] = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>force EOUT[1] = 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIN0</name>
              <description>Error Input 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EIN1</name>
              <description>Error Input 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>High</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>FCCU State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id000</name>
                  <description>NORMAL</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id001</name>
                  <description>CONFIG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id010</name>
                  <description>ALARM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id011</name>
                  <description>FAULT</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ESTAT</name>
              <description>FCCU Faulty Condition</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Not in faulty condition (in nonfaulty or configuration condition)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>In faulty condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PhysicErrorPin</name>
              <description>EOUT Signal States</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>EOUT1 is low; EOUT0 is low.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id01</name>
                  <description>EOUT1 is low; EOUT0 is high.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>EOUT1 is high; EOUT0 is low.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>EOUT1 is high; EOUT0 is high.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>N2AF_STATUS</name>
          <description>Normal-to-Alarm Freeze Status</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NAFS</name>
              <description>Normal-to-Alarm Freeze Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>A2FF_STATUS</name>
          <description>Alarm-to-Fault Freeze Status</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFFS</name>
              <description>Alarm-to-Fault Freeze Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AF_SRC</name>
              <description>Alarm-to-Fault Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>No Alarm-to-Fault-state fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>Non-critical fault</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Multiple Alarm-to-Fault-state faults</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>N2FF_STATUS</name>
          <description>Normal-to-Fault Freeze Status</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NFFS</name>
              <description>Normal-to-Fault Freeze Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NF_SRC</name>
              <description>Normal-to-Fault Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id00</name>
                  <description>No Normal-to-Fault-state fault</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id10</name>
                  <description>Non-critical fault</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id11</name>
                  <description>Multiple Normal-to-Fault-state faults</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>F2AF_STATUS</name>
          <description>Fault-to-Alarm Freeze Status</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAFS</name>
              <description>Fault-to-Alarm Freeze Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NCFF</name>
          <description>Non-critical Fault Fake</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FNCFC</name>
              <description>FNCFC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_STAT</name>
          <description>IRQ Status</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_TO_STAT</name>
              <description>Configuration-State Timeout Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>No configuration-stat timeout error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Configuration-state timeout error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALRM_STAT</name>
              <description>Alarm Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Alarm interrupt is OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Alarm interrupt is ON</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NMI_STAT</name>
              <description>NMI Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>NMI interrupt is OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>NMI interrupt is ON</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQ_EN</name>
          <description>IRQ Enable</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_TO_IEN</name>
              <description>Configuration-State Timeout Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>id0</name>
                  <description>Configuration-state timeout interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>id1</name>
                  <description>Configuration-state timeout interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRANS_LOCK</name>
          <description>Transient Configuration Lock</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRANSKEY</name>
              <description>Transient Configuration Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERMNT_LOCK</name>
          <description>Permanent Configuration Lock</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PERMNTKEY</name>
              <description>Permanent Configuration Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DELTA_T</name>
          <description>Delta T</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DELTA_T</name>
              <description>Minimum Fault-Output (EOUT) Timer Interval</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
