rob-zeno/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K312_M7.svd
        <register>
          <name>MBUFM0</name>
          <description>STCU2 MBIST Unrecoverable FM</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBUFM0</name>
              <description>MBESW</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM1</name>
              <description>MBESW</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM2</name>
              <description>MBESW</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM3</name>
              <description>MBESW</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM4</name>
              <description>MBESW</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM5</name>
              <description>MBESW</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM6</name>
              <description>MBESW</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM7</name>
              <description>MBESW</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM8</name>
              <description>MBESW</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM9</name>
              <description>MBESW</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM10</name>
              <description>MBESW</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MBUFM11</name>
              <description>MBESW</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RECOVERABLE</name>
                  <description>Recoverable fault mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNRECOVERABLE</name>
                  <description>Unrecoverable fault mapping</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LB_CTRL0</name>
          <description>STCU2 LBIST Control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CWS</name>
              <description>Capture window size CWS defines the capture window size.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ILLGEAL</name>
                  <description>Illegal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_1</name>
                  <description>Controller waits 1 shift cycle for capture to finish.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_2</name>
                  <description>Controller waits 2 shift cycles for capture to finish.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_3</name>
                  <description>Controller waits 3 shift cycles for capture to finish.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_4</name>
                  <description>Controller waits 4 shift cycles for capture to finish.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_5</name>
                  <description>Controller waits 5 shift cycles for capture to finish.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_6</name>
                  <description>Controller waits 6 shift cycles for capture to finish.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LEGAL_7</name>
                  <description>Controller waits 7 shift cycles for capture to finish.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCEN_ON</name>
              <description>Scan enable ON SCEN_ON information is used to configure the lbist controller hardware to generate on_cycles, delay cycles during the scan enable on transition, SCEN_ON delay register value must be programmed to a value &gt;=1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_0</name>
                  <description>0 delay cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_1</name>
                  <description>1 delay cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_2</name>
                  <description>2 delay cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_3</name>
                  <description>3 delay cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_4</name>
                  <description>4 delay cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_5</name>
                  <description>5 delay cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6</name>
                  <description>6 delay cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_7</name>
                  <description>7 delay cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_8</name>
                  <description>8 delay cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_9</name>
                  <description>9 delay cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_10</name>
                  <description>10 delay cycles</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_11</name>
                  <description>11 delay cycles</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_12</name>
                  <description>12 delay cycles</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_13</name>
                  <description>13 delay cycles</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_14</name>
                  <description>14 delay cycles</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_15</name>
                  <description>15 delay cycles</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCEN_OFF</name>
              <description>Scan enable OFF SCEN_OFF information is used to configure the lbist controller hardware to generate off_cycles, delay cycles during the scan enable off transition</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_0</name>
                  <description>0 delay cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_1</name>
                  <description>1 delay cycle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_2</name>
                  <description>2 delay cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_3</name>
                  <description>3 delay cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_4</name>
                  <description>4 delay cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_5</name>
                  <description>5 delay cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_6</name>
                  <description>6 delay cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_7</name>
                  <description>7 delay cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_8</name>
                  <description>8 delay cycles</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_9</name>
                  <description>9 delay cycles</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_10</name>
                  <description>10 delay cycles</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_11</name>
                  <description>11 delay cycles</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_12</name>
                  <description>12 delay cycles</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_13</name>
                  <description>13 delay cycles</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_14</name>
                  <description>14 delay cycles</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_15</name>
                  <description>15 delay cycles</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHS</name>
              <description>Shift speed SHS defines the shift speed</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Shift at full rate (BIST clock).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_2</name>
                  <description>Shift at 1/2 rate (BIST clock).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_3</name>
                  <description>Shift at 1/3 rate (BIST clock).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_4</name>
                  <description>Shift at 1/4 rate (BIST clock).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_5</name>
                  <description>Shift at 1/5 rate (BIST clock).</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_6</name>
                  <description>Shift at 1/6 rate (BIST clock).</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_7</name>
                  <description>Shift at 1/7 rate (BIST clock).</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIF_8</name>
                  <description>Shift at 1/8 rate (BIST clock).</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTR</name>
              <description>Next LBIST or MBIST pointer PTR defines the logical pointer to the next LBIST or MBIST to be scheduled</description>
              <bitOffset>21</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSM</name>
              <description>Concurrent/sequential mode The next LBIST is scheduled concurrently to the current one if the CSM bit is set to 1; otherwise, it is scheduled sequentially to the completion of the current LBIST execution</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQUENTIAL</name>
                  <description>Sequential mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONCURRENT</name>
                  <description>Concurrent mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
